--[[
按鍵說明
--]]


local function hotkeys(n)
  local s_1 = string.match( n, "^bo_mixin")
  local s_2 = string.match( n, "^bopomo_onionplus")
  local s_3 = string.match( n, "^bopomo_onion_double")
  local s_4 = string.match( n, "^onion[-]array30")
  local s_5 = string.match( n, "^ocm_")
  local s_6 = string.match( n, "^dif1")
  if s_1 or s_2 then
    k1_table = {
        { "【 注音 mixin 和 plus 系列 】", "🄋" }
      , { "　『 中/英 』", "➀" }
      , { "　　［shift］+［space］變換中英（未打字時）", "➁" }
      , { "　　［control］+［shift］+［2］變換中英", "➂" }
      , { "　　［control］+［ ，］切換英文", "➃" }
      , { "　　［control］+［shift］+［ ，］切換中文", "➄" }
      , { "　『 打字輸入 』", "➅" }
      , { "　 • 上屏", "➆" }
      , { "　　［return/Enter］上屏中文（有選項時）", "➇" }
      , { "　　［space］上屏中文（末尾為聲調時）", "➈" }
      , { " • 特殊上屏", "➀🄋" }
      , { "　［shift］+［return/Enter］輸出所對應的英文、數字、符號", "➀➀" }
      , { "　［control］+［return/Enter］輸出顯示編碼，如注音符號", "➀➁" }
      , { "　［control］+［shift］+［return/Enter］輸出選項注釋", "➀➂" }
      , { " • 刪除", "➀➃" }
      , { "　［esc］消除未上屏注音（清空）", "➀➄" }
      , { "　［delete/BackSpace］刪除單個字全部注音", "➀➅" }
      , { "　［shift］+［delete/BackSpace］刪除一個注音符號", "➀➆" }
      , { "　［ \\ ］刪除一個注音符號（選單出現時）", "➀➇" }
      , { " • 游標移位", "➀➈" }
      , { "　［right/left］游標向左右一整個字（打字時）", "➁🄋" }
      , { "　［shift］+［right/left］游標向左右一個注音", "➁➀" }
      , { "　［up］游標向左一個注音（打字時）", "➁➁" }
      , { "　［tab］和［shift］+［tab］首節（下一節）和上一節", "➁➂" }
      , { "　（↑ 首個中文字，好用可善用！）", "➁➃" }
      , { "　［tab］跳回游標切分狀態（選字時）", "➁➄" }
      , { " • 翻頁", "➁➅" }
      , { "　［right/left］選字單翻頁（選字時）", "➁➆" }
      , { "　［shift］+［up/down］選字單翻頁", "➁➇" }
      , { "　［shift］+［C］和［shift］+［space］選字單翻頁（輸入時）", "➁➈" }
      , { "　［shift］+［I］和［shift］+［K］選字單翻頁（輸入時）", "➂🄋" }
      , { " • 選字", "➂➀" }
      , { "　［shift］+［QAZWSX］選字（左邊）", "➂➁" }
      , { "　［shift］+［YHNUJM］選字（右邊）", "➂➂" }
      , { "　［control］+［123456］選字！（Mac會鍵位衝突！）", "➂➃" }
      , { " • 刪除自動記憶", "➂➄" }
      , { "　［fn］+［shift］+［BackSpace］選詞時，刪除自動記錄詞", "➂➅" }
      , { "　（↑ Mac）", "➂➆" }
      , { "　［shift/control］+［BackSpace］選詞時，刪除自動記錄詞", "➂➇" }
      , { "　（↑ Win）", "➂➈" }
      , { "　［shift］+［Delete］Mac 外接鍵盤沒 fn 鍵，刪除自動記錄詞", "➃🄋" }
      , { "　（↑ 注意該 Delete 非 BackSpace）", "➃➀" }
      }

    k2_table = {
        { "【 注音 mixin 和 plus 系列 】", "🄌" }
      , { "　『 方案選單 』", "➊" }
      , { "　　［control］+［ ` ］開啟方案選單（設置）", "➋" }
      , { "　　［control］+［shift］+［ ` ］開啟方案選單（設置）", "➌" }
      , { "　　［F4］開啟方案選單（設置）", "➍" }
      , { "　『 快捷鍵（上排/變換）』", "➎" }
      , { "　　［control］+［shift］+［1］變換方案", "➏" }
      , { "　　［control］+［shift］+［2］變換中英", "➐" }
      , { "　　［control］+［shift］+［3］變換全半形", "➑" }
      , { "　　［control］+［shift］+［4］變換標點全半形", "➒" }
      , { "　［control］+［shift］+［5］變換繁簡體", "➊🄌" }
      , { "　［control］+［shift］+［6］變換中文字符範圍", "➊➊" }
      , { "　［control］+［shift］+［7］變換附加 Emoji 有無", "➊➋" }
      , { "　［control］+［shift］+［8］變換外語和符號注釋有無", "➊➌" }
      , { "　［control］+［shift］+［9］變換《Easy》英文排序", "➊➍" }
      , { "『 快捷鍵（下排/指定）』", "➊➎" }
      , { "　［control］+［ ，］切換英文", "➊➏" }
      , { "　［control］+［shift］+［ ，］切換中文", "➊➐" }
      , { "　　--", "➊➑" }
      , { "　［control］+［ ．］切換全形（全角）", "➊➒" }
      , { "　［control］+［shift］+［ ．］切換半形（半角）", "➋🄌" }
      , { "　　--", "➋➊" }
      , { "　［control］+［ ／ ］切換標點半形", "➋➋" }
      , { "　［control］+［shift］+［ ／ ］切換標點全形（原注音形式）", "➋➌" }
      , { "　　--", "➋➍" }
      , { "　［control］+［ ；］切換簡體轉換", "➋➎" }
      , { "　［control］+［shift］+［ ；］切換不轉換簡體", "➋➏" }
      , { "　　--", "➋➐" }
      , { "　［control］+［ ' ］切換中文字符範圍為完整，不精簡", "➋➑" }
      , { "　［control］+［shift］+［ ' ］切換中文其字符範圍為精簡", "➋➒" }
      , { "　　--", "➌🄌" }
      , { "　［control］+［ [ ］切換附加 Emoji 為無", "➌➊" }
      , { "　［control］+［shift］+［ [ ］切換附加 Emoji為有", "➌➋" }
      , { "　　--", "➌➌" }
      , { "　［control］+［ ] ］切換外語和符號注釋為無", "➌➍" }
      , { "　［control］+［shift］+［ ] ］切換外語和符號注釋為有", "➌➎" }
      , { "　（↑ 例：æ 〔KK, DJ, IPA〕）", "➌➏" }
      , { "　（↑ 直按標點和「 = 」「符號」注釋無法關閉）", "➌➐" }
      , { "　　--", "➌➑" }
      , { "　［control］+［ = ］切換《Easy》英文排序為序排", "➌➒" }
      , { "　［control］+［shift］+［ = ］切換《Easy》英文排序為個排", "➍🄌" }
      , { "　（↑ 個排：按字母個數、序排：按 a~z）", "➍➊" }
      , { "　────────────  ", "➍➋" }
      , { "　※ 以上某些鍵位須用內附的 default.custom.yaml 檔", "➍➌" }
      }
    -- , { "　＊基本功能鍵", "🄋" }
    -- , { "＊洋蔥版功能鍵", "➀➇" }
    -- , { "　（洋蔥注音 plus 和 mixin 版限定，純注音版該鍵位為分節）", "➁🄋" }
    -- , { "　（［ QAZWSX ］和［ YHNUJM ］在鍵盤上為同樣形狀區塊，只是左邊移到右邊。）", "➃➂" }
    -- , { "　（［ QAZWSX ］方便單手選字；［ YHNUJM ］方便雙手選字。）", "➃➃" }
    -- , { "　（須使用內附的 default.custom.yaml 檔）", "➂➇" }
    -- , { "　（↑ 使用內附的 default.custom.yaml 檔才有效）", "➀➃" }
    -- , { "　預設功能快捷鍵多在上排，增設下排手順較好位置。", "➃➅" }
    -- , { "　以下快捷鍵切換不循環，使所切換之項目能完全肯定，含［ shift ］為初始設定。", "➃➆" }
    -- , { "　欲循環切換可使用［ control ］ +［ shift ］+［ 1～9 ］", "➃➇" }
    -- , { "• 以下八個快捷鍵，須使用內附的 default.custom.yaml 檔：", "➃➈" }
    -- , { "＊翻頁和選字", "➀🄋" }
    -- , { "　（↑ Rime 官方預設為［4］）", "➃➅" }
    -- , { "　　（↑ 整個字的注音，非單一個注音符號）", "➈" }

  elseif s_3 then
    k1_table = {
        { "【 注音雙拼 】", "🄋" }
      , { "　『 中/英 』", "➀" }
      , { "　　［shift］+［space］變換中英（未打字時）", "➁" }
      , { "　　［control］+［shift］+［2］變換中英", "➂" }
      , { "　　［control］+［ ，］切換英文", "➃" }
      , { "　　［control］+［shift］+［ ，］切換中文", "➄" }
      , { "　『 打字輸入 』", "➅" }
      , { "　 • 上屏", "➆" }
      , { "　　［space］上屏中文（有選項時）", "➇" }
      , { "　　［return/Enter］上屏中文（有選項時）", "➈" }
      , { " • 特殊上屏", "➀🄋" }
      , { "　［shift］+［return/Enter］輸出所對應的英文、數字、符號", "➀➀" }
      , { "　［control］+［return/Enter］輸出顯示編碼，如：ji/（ㄐㄧˊ）", "➀➁" }
      , { "　［control］+［shift］+［return/Enter］輸出選項注釋", "➀➂" }
      , { " • 刪除", "➀➃" }
      , { "　［esc］消除未上屏注音（清空）", "➀➄" }
      , { "　［space］消除未上屏輸入（清空）（空碼時）", "➀➅" }
      , { "　［delete/BackSpace］刪除一個注音符號", "➀➆" }
      , { "　［shift］+［delete/BackSpace］刪除單個字全部注音", "➀➇" }
      , { " • 分節", "➀➈" }
      , { "　［ \\ ］分節（選單出現時）", "➁🄋" }
      , { " • 游標移位", "➁➀" }
      , { "　［right/left］游標向左右一個注音", "➁➁" }
      , { "　［shift］+［right/left］游標向左右一整個字（打字時）", "➁➂" }
      , { "　［up］游標向左一整個字（打字時）", "➁➃" }
      , { "　［tab］和［shift］+［tab］首節（下一節）和上一節", "➁➄" }
      , { "　（↑ 首個中文字，好用可善用！）", "➁➅" }
      , { "　［tab］跳回游標切分狀態（選字時）", "➁➆" }
      , { " • 翻頁", "➁➇" }
      , { "　［right/left］選字單翻頁（選字時）", "➁➈" }
      , { "　［shift］+［up/down］選字單翻頁", "➂🄋" }
      , { "　［shift］+［space］和［shift］+［tab］選字單翻頁（輸入時）", "➂➀" }
      , { " • 選字", "➂➁" }
      , { "　［123456］選字", "➂➂" }
      , { "　［control］+［123456］選字！（Mac會鍵位衝突！）", "➂➃" }
      , { " • 刪除自動記憶", "➂➄" }
      , { "　［fn］+［shift］+［BackSpace］選詞時，刪除自動記錄詞", "➂➅" }
      , { "　（↑ Mac）", "➂➆" }
      , { "　［shift/control］+［BackSpace］選詞時，刪除自動記錄詞", "➂➇" }
      , { "　（↑ Win）", "➂➈" }
      , { "　［shift］+［Delete］Mac 外接鍵盤沒 fn 鍵，刪除自動記錄詞", "➃🄋" }
      , { "　（↑ 注意該 Delete 非 BackSpace）", "➃➀" }
      }

    k2_table = {
        { "【 注音雙拼 】", "🄌" }
      , { "　『 方案選單 』", "➊" }
      , { "　　［control］+［ ` ］開啟方案選單（設置）", "➋" }
      , { "　　［control］+［shift］+［ ` ］開啟方案選單（設置）", "➌" }
      , { "　　［F4］開啟方案選單（設置）", "➍" }
      , { "　『 快捷鍵（上排/變換）』", "➎" }
      , { "　　［control］+［shift］+［1］變換方案", "➏" }
      , { "　　［control］+［shift］+［2］變換中英", "➐" }
      , { "　　［control］+［shift］+［3］變換全半形", "➑" }
      , { "　　［control］+［shift］+［4］變換標點全半形", "➒" }
      , { "　［control］+［shift］+［5］變換繁簡體", "➊🄌" }
      , { "　［control］+［shift］+［6］變換中文字符範圍（CJK）", "➊➊" }
      , { "『 快捷鍵（下排/指定）』", "➊➋" }
      , { "　［control］+［ ，］切換英文", "➊➌" }
      , { "　［control］+［shift］+［ ，］切換中文", "➊➍" }
      , { "　　--", "➊➎" }
      , { "　［control］+［ ．］切換全形（全角）", "➊➏" }
      , { "　［control］+［shift］+［ ．］切換半形（半角）", "➊➐" }
      , { "　　--", "➊➑" }
      , { "　［control］+［ ／ ］切換標點半形", "➊➒" }
      , { "　［control］+［shift］+［ ／ ］切換標點全形", "➋🄌" }
      , { "　　--", "➋➊" }
      , { "　［control］+［ ；］切換簡體轉換", "➋➋" }
      , { "　［control］+［shift］+［ ；］切換不轉換簡體", "➋➌" }
      , { "　　--", "➋➍" }
      , { "　［control］+［ ' ］切換中文字符範圍為完整，不精簡", "➋➎" }
      , { "　［control］+［shift］+［ ' ］切換中文其字符範圍為精簡（CJK）", "➋➏" }
      , { "　────────────  ", "➋➐" }
      , { "　※ 以上某些鍵位須用內附的 default.custom.yaml 檔", "➋➑" }
      }

  elseif s_4 then
    k1_table = {
        { "【 行列３０ 】", "🄋" }
      , { "　『 中/英 』", "➀" }
      , { "　　［shift］+［space］變換中英（未打字時）", "➁" }
      , { "　　［control］+［shift］+［2］變換中英", "➂" }
      , { "　　［control］+［ ，］切換英文", "➃" }
      , { "　　［control］+［shift］+［ ，］切換中文", "➄" }
      , { "　　『 打字輸入 』", "➅" }
      , { "　 • 上屏", "➆" }
      , { "　　［space］上屏中文（有選項時）", "➇" }
      , { "　 • 特殊上屏", "➈" }
      , { "　［shift］+［return/Enter］輸出所對應的英文、數字、符號", "➀🄋" }
      , { "　［control］+［return/Enter］輸出顯示編碼，如：「7⇣4-9-」", "➀➀" }
      , { "　［control］+［shift］+［return/Enter］輸出選項注釋", "➀➁" }
      , { " • 刪除", "➀➂" }
      , { "　［esc］消除未上屏輸入（清空）", "➀➃" }
      , { "　［space］消除未上屏輸入（清空）（空碼時）", "➀➄" }
      , { "　［delete/BackSpace］刪除一個輸入碼", "➀➅" }
      , { " • 翻頁", "➀➆" }
      , { "　［right/left］選字單翻頁（選字時）", "➀➇" }
      , { "　［shift］+［up/down］選字單翻頁", "➀➈" }
      , { "　［shift］+［space］和［shift］+［tab］選字單翻頁（輸入時）", "➁🄋" }
      , { " • 選字", "➁➀" }
      , { "　［1234567890］選字", "➁➁" }
      , { "　［control］+［1234567890］選字！（Mac會鍵位衝突！）", "➁➂" }
      -- , { "", "➁➃" }
      }

    k2_table = {
        { "【 行列３０ 】", "🄌" }
      , { "　『 方案選單 』", "➊" }
      , { "　　［control］+［ ` ］開啟方案選單（設置）", "➋" }
      , { "　　［control］+［shift］+［ ` ］開啟方案選單（設置）", "➌" }
      , { "　　［F4］開啟方案選單（設置）", "➍" }
      , { "　『 快捷鍵（上排/變換）』", "➎" }
      , { "　　［control］+［shift］+［1］變換方案", "➏" }
      , { "　　［control］+［shift］+［2］變換中英", "➐" }
      , { "　　［control］+［shift］+［3］變換全半形", "➑" }
      , { "　　［control］+［shift］+［4］變換標點全半形", "➒" }
      , { "　［control］+［shift］+［5］變換繁簡體", "➊🄌" }
      , { "　［control］+［shift］+［6］變換中文字符範圍", "➊➊" }
      , { "　［control］+［shift］+［7］變換編碼標注有無", "➊➋" }
      , { "　［control］+［shift］+［8］變換上屏簡碼(多個)為直上或香草", "➊➌" }
      , { "　［control］+［shift］+［9］變換 w 符號 space 為翻頁或上屏", "➊➍" }
      , { "　［control］+［shift］+［0］變換 return/Enter 是否上屏中文", "➊➎" }
      , { "　（↑ Win 會鍵位衝突！）", "➊➏" }
      , { "『 快捷鍵（下排/指定）』", "➊➐" }
      , { "　［control］+［ ，］切換英文", "➊➑" }
      , { "　［control］+［shift］+［ ，］切換中文", "➊➒" }
      , { "　　--", "➋🄌" }
      , { "　［control］+［ ．］切換全形（全角）", "➋➊" }
      , { "　［control］+［shift］+［ ．］切換半形（半角）", "➋➋" }
      , { "　　--", "➋➌" }
      , { "　［control］+［ ／ ］切換標點半形", "➋➍" }
      , { "　［control］+［shift］+［ ／ ］切換標點全形", "➋➎" }
      , { "　　--", "➋➏" }
      , { "　［control］+［ ；］切換簡體轉換", "➋➐" }
      , { "　［control］+［shift］+［ ；］切換不轉換簡體", "➋➑" }
      , { "　　--", "➋➒" }
      , { "　［control］+［ ' ］切換中文字符範圍為完整（增廣），不精簡", "➌🄌" }
      , { "　［control］+［shift］+［ ' ］切換中文其字符範圍為精簡（CJK）", "➌➊" }
      , { "　　--", "➌➋" }
      , { "　［control］+［ [ ］切換編碼標注為無", "➌➌" }
      , { "　［control］+［shift］+［ [ ］切換變換編碼標注為有", "➌➍" }
      , { "　　--", "➌➎" }
      , { "　［control］+［ ] ］切換上屏簡碼(多個)為香草模式", "➌➏" }
      , { "　［control］+［shift］+［ ] ］切換上屏簡碼(多個)為直上", "➌➐" }
      , { "　　--", "➌➑" }
      , { "　［control］+［ - ］切換 w 符號 space 為翻頁", "➌➒" }
      , { "　［control］+［shift］+［ - ］切換 w 符號 space 為上屏", "➍🄌" }
      , { "　　--", "➍➊" }
      , { "　［control］+［ = ］切換 return/Enter 上屏中文", "➍➋" }
      , { "　［control］+［shift］+［ = ］切換 return/Enter 上屏原始輸入碼", "➍➌" }
      , { "　────────────  ", "➍➍" }
      , { "　※ 以上某些鍵位須用內附的 default.custom.yaml 檔", "➍➎" }
      }
      -- , { "　［shift］+［delete/BackSpace］刪除一個輸入碼", "➀➀" }
      -- , { " • 游標移位", "➀➅" }
      -- , { "　［right/left］游標向左右一個編碼", "➀➆" }
      -- , { "　［shift］+［right/left］游標向左右一整個字（打字時）", "➀➇" }
      -- , { "　（↑ 不上屏中文，則上屏原始輸入碼）", "➅➅" }

  elseif s_5 or s_6 then
    k1_table = {
        { "【 形碼方案 】", "🄋" }
      , { "　『 中/英 』", "➀" }
      , { "　　［shift］+［space］變換中英（未打字時）", "➁" }
      , { "　　［control］+［shift］+［2］變換中英", "➂" }
      , { "　　［control］+［ ，］切換英文", "➃" }
      , { "　　［control］+［shift］+［ ，］切換中文", "➄" }
      , { "　『 打字輸入 』", "➅" }
      , { "　 • 上屏", "➆" }
      , { "　　［space］上屏中文（有選項時）", "➇" }
      , { "　　［return/Enter］上屏中文（有選項時）", "➈" }
      , { " • 特殊上屏", "➀🄋" }
      , { "　［shift］+［return/Enter］輸出所對應的英文、數字、符號", "➀➀" }
      , { "　［control］+［return/Enter］輸出顯示編碼，如：DJ", "➀➁" }
      , { "　［control］+［shift］+［return/Enter］輸出選項注釋", "➀➂" }
      , { " • 刪除", "➀➃" }
      , { "　［esc］消除未上屏注音（清空）", "➀➄" }
      , { "　［delete/BackSpace］刪除一個注音符號", "➀➅" }
      , { "　［shift］+［delete/BackSpace］刪除單個字全部注音", "➀➆" }
      , { " • 分節", "➀➇" }
      , { "　［ | ］分節（選單出現時）", "➀➈" }
      , { " • 游標移位", "➁🄋" }
      , { "　［right/left］游標向左右一個編碼（打字時）", "➁➀" }
      , { "　［shift］+［right/left］游標向左右一整個字", "➁➁" }
      , { "　［up］游標向左一整個字（打字時）", "➁➂" }
      , { "　［tab］和［shift］+［tab］首節（下一節）和上一節", "➁➃" }
      , { "　（↑ 首個中文字，好用可善用！）", "➁➄" }
      , { "　［tab］跳回游標切分狀態（選字時）", "➁➅" }
      , { " • 翻頁", "➁➆" }
      , { "　［right/left］選字單翻頁（選字時）", "➁➇" }
      , { "　［shift］+［up/down］選字單翻頁", "➁➈" }
      , { "　［shift］+［C］和［shift］+［space］選字單翻頁（輸入時）", "➂🄋" }
      , { " • 選字", "➂➀" }
      , { "　［012345678］選字", "➂➁" }
      , { "　［control］+［012345678］選字！（Mac會鍵位衝突！）", "➂➂" }
      , { " • 刪除自動記憶", "➂➃" }
      , { "　［fn］+［shift］+［BackSpace］選詞時，刪除自動記錄詞", "➂➄" }
      , { "　（↑ Mac）", "➂➅" }
      , { "　［shift/control］+［BackSpace］選詞時，刪除自動記錄詞", "➂➆" }
      , { "　（↑ Win）", "➂➇" }
      , { "　［shift］+［Delete］Mac 外接鍵盤沒 fn 鍵，刪除自動記錄詞", "➂➈" }
      , { "　（↑ 注意該 Delete 非 BackSpace）", "➃🄋" }
      }

    k2_table = {
        { "【 形碼方案 】", "🄌" }
      , { "　『 方案選單 』", "➊" }
      , { "　　［control］+［ ` ］開啟方案選單（設置）", "➋" }
      , { "　　［control］+［shift］+［ ` ］開啟方案選單（設置）", "➌" }
      , { "　　［F4］開啟方案選單（設置）", "➍" }
      , { "　『 快捷鍵（上排/變換）』", "➎" }
      , { "　　［control］+［shift］+［1］變換方案", "➏" }
      , { "　　［control］+［shift］+［2］變換中英", "➐" }
      , { "　　［control］+［shift］+［3］變換全半形", "➑" }
      , { "　　［control］+［shift］+［4］變換標點全半形", "➒" }
      , { "　［control］+［shift］+［5］變換繁簡體", "➊🄌" }
      , { "　［control］+［shift］+［6］變換中文字符範圍", "➊➊" }
      , { "　［control］+［shift］+［7］變換附加 Emoji 有無", "➊➋" }
      , { "　［control］+［shift］+［8］變換編碼標注有無", "➊➌" }
      , { "　［control］+［shift］+［9］變換外語和符號注釋有無", "➊➍" }
      , { "　［control］+［shift］+［0］變換《Easy》英文排序", "➊➎" }
      , { "　（↑ Win 會鍵位衝突！）", "➊➏" }
      , { "", "➊➐" }
      , { "『 快捷鍵（下排/指定）』", "➊➑" }
      , { "　［control］+［ ，］切換英文", "➊➒" }
      , { "　［control］+［shift］+［ ，］切換中文", "➋🄌" }
      , { "　　--", "➋➊" }
      , { "　［control］+［ ．］切換全形（全角）", "➋➋" }
      , { "　［control］+［shift］+［ ．］切換半形（半角）", "➋➌" }
      , { "　　--", "➋➍" }
      , { "　［control］+［ ／ ］切換標點半形", "➋➎" }
      , { "　［control］+［shift］+［ ／ ］切換標點全形", "➋➏" }
      , { "　　--", "➋➐" }
      , { "　［control］+［ ；］切換簡體轉換", "➋➑" }
      , { "　［control］+［shift］+［ ；］切換不轉換簡體", "➋➒" }
      , { "　　--", "➌🄌" }
      , { "　［control］+［ ' ］切換中文字符範圍為完整，不精簡", "➌➊" }
      , { "　［control］+［shift］+［ ' ］切換中文其字符範圍為精簡", "➌➋" }
      , { "　　--", "➌➌" }
      , { "　［control］+［ [ ］切換編碼標注為無", "➌➍" }
      , { "　［control］+［shift］+［ [ ］切換變換編碼標注為有", "➌➎" }
      , { "　　--", "➌➏" }
      , { "　［control］+［ ] ］切換外語和符號注釋為無", "➌➐" }
      , { "　［control］+［shift］+［ ] ］切換外語和符號注釋為有", "➌➑" }
      , { "　（↑ 例：æ 〔KK, DJ, IPA〕）", "➌➒" }
      , { "　（↑ 直按標點和「 = 」「符號」注釋無法關閉）", "➍🄌" }
      , { "　　--", "➍➊" }
      , { "　［control］+［ = ］切換《Easy》英文排序為序排", "➍➋" }
      , { "　［control］+［shift］+［ = ］切換《Easy》英文排序為個排", "➍➌" }
      , { "　（↑ 個排：按字母個數、序排：按 a~z）", "➍➍" }
      , { "　────────────  ", "➍➎" }
      , { "　※ 以上某些鍵位須用內附的 default.custom.yaml 檔", "➍➏" }
      }

  else
    k1_table = {
        { "【 不明方案 】", "🄋" }
      -- , { "　待補", "➀" }
      }

    k2_table = {
        { "【 不明方案 】", "🄌" }
      -- , { "　待補", "➊" }
      }

  end
  return {k1_table, k2_table}
end

return hotkeys