--[[
各種語言編碼鍵位說明
--]]

local kh_table = {
    { "『 單子音 』", "🄀" }
  , { "　ㄱ g 　ㄷ d      　ㅂ b     　ㅅ s 　ㅇ x (ng)　", "⒈" }
  , { "　ㅋ k 　ㅌ t       　ㅍ p (f)　ㅈ j 　ㅎ h　", "⒉" }
  , { "　ㄴ n 　ㄹ L (r) 　ㅁ m    　ㅊ c　", "⒊" }
  , { "『 雙子音 』", "⒋" }
  , { "　ㄲ gg　ㄸ dd　ㅃ bb　ㅆ ss　ㅉ jj　", "⒌" }
  , { "『 單母音 』", "⒍" }
  , { "　ㅣ i   　ㅏ a  　ㅑ ya　", "⒎" }
  , { "　ㅡ w 　ㅜ u  　ㅠ yu　", "⒏" }
  , { "　　     　ㅓ e  　ㅕ ye　", "⒐" }
  , { "　　     　ㅗ o  　ㅛ yo　", "⒑" }
  , { "『 雙母音 』", "⒒" }
  , { "　ㅐ ai 　ㅒ yai 　ㅘ oa  　ㅝ ue　", "⒓" }
  , { "　ㅔ ei 　ㅖ yei 　ㅙ oai 　ㅞ uei　", "⒔" }
  , { "　　    　　        　ㅚ oi    　ㅟ ui 　ㅢ wi　", "⒕" }
  , { "────────────  ", "⒖" }
  -- , { "------------------------------", "⒖" }
  , { "※  i ↔ y 可互換　", "⒗" }
  , { "────────────  ", "⒘" }
  -- , { "------------------------------", "⒘" }
  , { "", "⒙" }
  , { "", "⒚" }
  , { "", "⒛" }
  }

local ks_table = {
    { "　『 基礎字根 』", "🄁" }
  , { "　　A ㅂ　　B ㅅ　　C ㄷ　　D ㅊ　　E ㅌ　　F ㅑ　　G ㅕ　", "🄂" }
  , { "　　H ㅐ　　I ㅣ　　J ㅓ　　K ㅏ　　L ㄴ　　M ㅛ　　N ㅗ　", "🄃" }
  , { "　　O ㅁ　　P ㅔ　　Q ㅇ　　R ㅠ　　S ㄹ　　T ㅜ　　U ㅈ　", "🄄" }
  , { "　　V ㅡ　　W ㅎ　　X ㅍ　　Y ㄱ　　Z ㅋ　", "🄅" }
  , { "　　AA ㅃ  /  BB  ㅆ  /  CC ㄸ  /  HH ㅒ  /  PP ㅖ  /  UU ㅉ  /  YY ㄲ　", "🄆" }
  , { "　『 簡速字根 』", "🄇" }
  , { "　　A ㅝ　　D ㅟ　　E ㅘ　　F ㄲ　　G ㄸ/ㄶ　", "🄈" }
  , { "　　H ㅄ　　I ㄿ　　J ㄺ　　K ㅉ/ㄵ　L ㅢ　", "🄉" }
  , { "　　M ㅆ　　N ㄻ　　O ㅒ　　P ㄽ　　Q ㅖ　", "🄊" }
  , { "　R ㅃ/ㄼ　S ㅙ　　T ㄾ　　V ㄳ　　W ㅀ (對調前碼)", "１🄁" }
  , { "　X ㅚ　　Z ㅞ　", "１🄂" }
  }

local kj_table = {
    { "　『 五十音 』", "０" }
  , { "　　あ/ア a　い/イ i　う/ウ u　え/エ e　お/オ o　", "１" }
  , { "　　か/カ ka　き/キ ki　く/ク ku　け/ケ ke　こ/コ ko　", "２" }
  , { "　　さ/サ sa　し/シ shi (si)　す/ス su　せ/セ se　そ/ソ so　", "３" }
  , { "　　た/タ ta　ち/チ chi (ti)　つ/ツ tsu (tu)　て/テ te　と/ト to　", "４" }
  , { "　　な/ナ na　に/ニ ni　ぬ/ヌ nu　ね/ネ ne　の/ノ no　", "５" }
  , { "　　は/ハ ha　ひ/ヒ hi　ふ/フ fu (hu)　へ/ヘ he　ほ/ホ ho　", "６" }
  , { "　　ま/マ ma　み/ミ mi　む/ム mu　め/メ me　も/モ mo　", "７" }
  , { "　　や/ヤ ya　ゆ/ユ yu　よ/ヨ yo　", "８" }
  , { "　　ら/ラ ra　り/リ ri　る/ル ru　れ/レ re　ろ/ロ ro　", "９" }
  , { "　わ/ワ wa　を/ヲ wo　ん/ン n", "１０" }
  , { "　ゐ/ヰ wi (i/wyi)　ゑ/ヱ we (e/wye)　", "１１" }
  , { "『 濁音和半濁音 』", "１２" }
  , { "　が/ガ ga　ぎ/ギ gi　ぐ/グ gu　げ/ゲ ge　ご/ゴ go　", "１３" }
  , { "　ざ/ザ za　じ/ジ ji (zi)　ず/ズ zu　ぜ/ゼ ze　ぞ/ゾ zo　", "１４" }
  , { "　だ/ダ da　ぢ/ヂ di　づ/ヅ du　で/デ de　ど/ド do　", "１５" }
  , { "　ば/バ ba　び/ビ bi　ぶ/ブ bu　べ/ベ be　ぼ/ボ bo　", "１６" }
  , { "　ぱ/パ pa　ぴ/ピ pi　ぷ/プ pu　ぺ/ペ pe　ぽ/ポ po　", "１７" }
  , { "　ヷ va　ヸ vi　ゔ/ヴ vu　ヹ ve　ヺ vo　", "１８" }
  , { "『 小寫 』", "１９" }
  , { "　ぁ/ァ xa　ぃ/ィ xi　ぅ/ゥ xu　ぇ/ェ xe　ぉ/ォ xo　", "２０" }
  , { "　っ/ッ xtu (xtsu)　ゎ/ヮ xwa　", "２１" }
  , { "　ゃ/ャ xya　ゅ/ュ xyu　ょ/ョ xyo　", "２２" }
  , { "　ゕ/ヵ xka (ヵ=ka)　ゖ/ヶ xke (ヶ=ke/ga)　", "２３" }
  , { "『 拗音 』", "２４" }
  , { "　きゃ/キャ kya　きゅ/キュ kyu　きょ/キョ kyo　", "２５" }
  , { "　ぎゃ/ギャ gya　ぎゅ/ギュ gyu　ぎょ/ギョ gyo　", "２６" }
  , { "　しゃ/シャ sha (sya)　しゅ/シュ shu (syu)　しょ/ショ sho (syo)　", "２７" }
  , { "　じゃ/ジャ ja (jya/zya)　じゅ/ジュ ju (jyu/zyu)　じょ/ジョ jo (jyo/zyo)　", "２８" }
  , { "　ぢゃ/ヂャ dya (ja/zya)　ぢゅ/ヂュ dyu (ju/zyu)　ぢょ/ヂョ dyo (jo/zyo)　", "２９" }
  , { "　ちゃ/チャ cha (tya/cya)　ちゅ/チュ chu (tyu/cyu)　ちょ/チョ cho (tyo/cyo)　", "３０" }
  , { "　にゃ/ニャ nya　にゅ/ニュ nyu　にょ/ニョ nyo　", "３１" }
  , { "　ひゃ/ヒャ hya　ひゅ/ヒュ hyu　ひょ/ヒョ hyo　", "３２" }
  , { "　びゃ/ビャ bya　びゅ/ビュ byu　びょ/ビョ byo　", "３３" }
  , { "　ぴゃ/ピャ pya　ぴゅ/ピュ pyu　ぴょ/ピョ pyo　", "３４" }
  , { "　みゃ/ミャ mya　みゅ/ミュ myu　みょ/ミョ myo　", "３５" }
  , { "　りゃ/リャ rya　りゅ/リュ ryu　リョ/りょ ryo　", "３６" }
  , { "════════════  ", "３７" }
  -- , { "==============================", "３７" }
  , { "『 外來語 』", "３８" }
  , { "　いぃ/イィ yi　いぇ/イェ ye　", "３９" }
  , { "　うゅ/ウュ wyu　", "４０" }
  , { "　うぁ/ウァ wha　うぃ/ウィ whi (wi)　うぅ/ウゥ whu　うぇ/ウェ whe (we)　うぉ/ウォ who　", "４１" }
  , { "　ゔぁ/ヴァ va　ゔぃ/ヴィ vi (vyi)　ゔぇ/ヴェ ve (vye)　ゔぉ/ヴォ vo　", "４２" }
  , { "　ゔゃ/ヴャ vya　ゔゅ/ヴュ vyu　ゔょ/ヴョ vyo　", "４３" }
  , { "　ゔぃぇ/ヴィェ vye　", "４４" }
  , { "　くぁ/クァ qwa　くぃ/クィ qwi (qyi)　くぅ/クゥ qwu　くぇ/クェ qwe (qye)　くぉ/クォ qwo　", "４５" }
  , { "　くぁ/クァ/くゎ/クヮ kwa　くぃ/クィ kwi　くぅ/クゥ kwu　くぇ/クェ kwe　くぉ/クォ kwo　", "４６" }
  , { "　くゃ/クャ qya　くゅ/クュ qyu　くょ/クョ qyo　", "４７" }
  , { "　ぐぁ/グァ/ぐゎ/グヮ gwa　ぐぃ/グィ gwi　ぐぅ/グゥ gwu　ぐぇ/グェ gwe　ぐぉ/グォ gwo　", "４８" }
  , { "　きぃ/キィ kyi　きぇ/キェ kye　", "４９" }
  , { "　ぎぃ/ギィ gyi　ぎぇ/ギェ gye　", "５０" }
  , { "　しぃ/シィ syi　しぇ/シェ sye (she)　", "５１" }
  , { "　じぃ/ジィ jyi (zyi)　じぇ/ジェ jye (je zye)　", "５２" }
  , { "　すぁ/スァ swa　すぃ/スィ swi　すぅ/スゥ swu　すぇ/スェ swe　すぉ/スォ swo　", "５３" }
  , { "　すゅ/スュ syu　", "５４" }
  , { "　ずゅ/ズュ zyu　ずぃ/ズィ zwi　ずゎ/ズヮ zwa　", "５５" }
  , { "　ちぃ/チィ cyi (tyi)　ちぇ/チェ che (cye tye)　", "５６" }
  , { "　ぢぃ/ヂィ dyi　ぢぇ/ヂェ dye　", "５７" }
  , { "　てゃ/テャ tha　てぃ/ティ thi　てぇ/テェ the　てょ/テョ tho　", "５８" }
  , { "　てゅ/テュ thu (tyu)　", "５９" }
  , { "　でゃ/デャ dha　でぃ/ディ dhi　でぇ/デェ dhe　でょ/デョ dho　", "６０" }
  , { "　でゅ/デュ dhu (dyu)　", "６１" }
  , { "　つぁ/ツァ tsa　つぃ/ツィ tsi　つぇ/ツェ tse　つぉ/ツォ tso　", "６２" }
  , { "　つゅ/ツュ tsyu　", "６３" }
  , { "　とぁ/トァ twa　とぃ/トィ twi　とぅ/トゥ twu　とぇ/トェ twe　とぉ/トォ two　", "６４" }
  , { "　どぁ/ドァ dwa　どぃ/ドィ dwi　どぅ/ドゥ dwu　どぇ/ドェ dwe　どぉ/ドォ dwo　", "６５" }
  , { "　にぃ/ニィ nyi　にぇ/ニェ nye　", "６６" }
  , { "　ひぃ/ヒィ hyi　ひぇ/ヒェ hye　", "６７" }
  , { "　びぃ/ビィ byi　びぇ/ビェ bye　", "６８" }
  , { "　びゎ/ビヮ bwa　", "６９" }
  , { "　ぴぃ/ピィ pyi　ぴぇ/ピェ pye　", "７０" }
  , { "　ふぁ/ファ fwa (fa)　ふぃ/フィ fwi (fi fyi)　ふぅ/フゥ fwu　ふぇ/フェ fwe (fe fye)　ふぉ/フォ fwo (fo)　", "７１" }
  , { "　ふゃ/フャ fya　ふゅ/フュ fyu　ふょ/フョ fyo　", "７２" }
  , { "　ふぃぇ/フィェ fye　", "７３" }
  , { "　ぷゎ/プヮ pwa　", "７４" }
  , { "　ほぅ/ホゥ hwu　", "７５" }
  , { "　みぃ/ミィ myi　みぇ/ミェ mye　", "７６" }
  , { "　りぃ/リィ ryi (lyi)　りぇ/リェ rye (lye)　", "７７" }
  }

local ki_table = {
    { "  ※  (…) 內為編碼，前為 IPA 字符", "⁰" }
  , { "  ※ 「;」→ 大寫，「''」→ 組合附加符號（注音方案改「;;」）", "¹" }
  , { "  ════════════  ", "²" }
  -- , { "  ==============================", "²" }
  , { "  『 母音/元音 』", "³" }
  , { "  　　 ｜     前     ┊     央     ┊     後     ｜", "⁴" }
  , { "  閉　 ｜ i(i)　y(y) ┊ ɨ(it)　ʉ(ut) ┊ ɯ(mq)　u(u) ｜", "⁵" }
  , { "  次閉 ｜ ɪ(ii;)　ʏ(yi;) ┊  ┊ ʊ(wk) ｜", "⁶" }
  , { "  半閉 ｜ e(e)　ø(ox) ┊ ɘ(ek) ɵ(qi) ┊ ɤ(vo/yo/oy)　o(o) ｜", "⁷" }
  , { "  中　 ｜ 　 ┊ ə(eq) ┊ 　 ｜", "⁸" }
  , { "  半開 ｜ ɛ(ei)　œ(ohe) ┊ ɜ(zi)　ɞ(bf) ┊ ʌ(li/vk)　ɔ(jf/ck) ｜", "⁹" }
  , { "次開 ｜ æ(ahe) ┊ ɐ(aq) ┊ 　 ｜", "¹⁰" }
  , { "開　 ｜ a(a)　ɶ(ohe;) ┊  ┊ ɑ(ai)　ɒ(aq) ｜", "¹¹" }
  , { "════════════  ", "¹²" }
  -- , { "==============================", "¹²" }
  , { "『 子音/輔音（肺部氣流音） 』", "¹³" }
  , { "塞音：p(p)　b(b)　t(t)　d(d)　ʈ(ti/tc)　ɖ(dc/dt)　c(c)", "¹⁴" }
  , { "　　　ɟ(jt)　k(k)　ɡ(gi)　q(q)　ɢ(gi;)　ʔ(jfy/jy/jfk)", "¹⁵" }
  , { "鼻音：m(m)　ɱ(mj)　n(n)　ɳ(nc)　ɲ(nj)　ŋ(nj)　ɴ(ni;)", "¹⁶" }
  , { "顫音：ʙ(bi;)　r(r)　ʀ(ri;/ihr;)", "¹⁷" }
  , { "閃音：ⱱ(vr)　ɾ(jq/lfk)　ɽ(rc)", "¹⁸" }
  , { "擦音：ɸ(fi)　β(bi)　f(f)　v(v)　θ(qi)　ð(dfx/dx/dt)", "¹⁹" }
  , { "　　　s(s)　z(z)　ʃ(sf)　ʒ(zf)　ʂ(sc)　ʐ(zc)　ç(cj)", "²⁰" }
  , { "　　　ʝ(jg/ig)　x(x)　ɣ(vo/no/go)　χ(xi)", "²¹" }
  , { "　　　ʁ(rk;)　ħ(ht)　ʕ(cfy/cy/cfk)　h(h)　ɦ(hr)", "²²" }
  , { "邊擦音：ɬ(lk/ik)　ɮ(lzf/lhzf)", "²³" }
  , { "近音：ʋ(vf/yi)　ɹ(rq)　ɻ(rrq/rqc)", "²⁴" }
  , { "　　　j(j)　ɰ(xf/mqy/mrq/wy/whi/uhu)", "²⁵" }
  , { "邊近音：l(l)　ɭ(lc)　ʎ(yq)　ʟ(li;)", "²⁶" }
  , { "════════════  ", "²⁷" }
  -- , { "==============================", "²⁷" }
  , { "『 子音/輔音（非肺部氣流音） 』", "²⁸" }
  , { "搭嘴音：ʘ(oma)　ǀ(iw)　ǃ(ifk)　ǂ(itt/ltt/nfq/iwtt/tft)　ǁ(iwiw)", "²⁹" }
  , { "內爆音：ɓ(br/gq)　ɗ(dr)　ʄ(sft/sftt)　ɠ(gr)　ʛ(gr;)", "³⁰" }
  , { "擠喉音：ʼ(dw)　pʼ(p)(dw)　tʼ(t)(dw)　kʼ(k)(dw)　sʼ(s)(dw)", "³¹" }
  , { "════════════  ", "³²" }
  -- , { "==============================", "³²" }
  , { "『 其他記號 』", "³³" }
  , { "　ʍ(wk)　w(w)　ɥ(hq/ui)　ʜ(hi;)", "³⁴" }
  , { "　ʢ(cfyt/cyt/cfkt/cftf)　ʡ(jfyt/jyt/jfkt/jftf)", "³⁵" }
  , { "　ɕ(cg/gfq)　ʑ(zg)　ɻ(rrq/rqc)　ɧ(hrj/hjr/jqg/hrc/hcr)", "³⁶" }
  , { "　ts͜(t)(s)(du'')　kp͡(k)(p)(m'')", "³⁷" }
  , { "════════════  ", "³⁸" }
  -- , { "==============================", "³⁸" }
  , { "『 變音符號 』", "³⁹" }
  , { "　◌̥(do'') ˳(dow)　◌̬(dv'') ˬ(dvw)　◌ͪ(hh'') ʰ(hh)", "⁴⁰" }
  , { "　◌̹(dj'') ˒(djw/jw)　◌̜(dc'') ˓(dcw/cw)　◌̟(dt'') ˖(dtw/tw/dtfh)", "⁴¹" }
  , { "　◌̠(de'') ˍ(dew) ˗(dew/ew)　◌̈(b'') ¨(bw)　◌̽(x'') ˟(xw) ˣ(xh)", "⁴²" }
  , { "　◌̩(dp'') ˌ(dpw/yw/dyw)　◌̯(dm'')", "⁴³" }
  , { "　˞(kw) ɚ(eqk) ɝ(zk/zr) a˞(a)(kw)", "⁴⁴" }
  , { "　◌̤(db'')　◌̰(ds'') ˷(dsw)　◌̼(dy'')", "⁴⁵" }
  , { "　ʷ(wh)　ʲ(jh)　ˠ(voh/noh/goh)　ˤ(cfyh/cfkh/cyh)", "⁴⁶" }
  , { "　◌̪(dr'')　◌̺(drk'')　◌̻(do'')　◌̃(s'') ˜(sw)　ⁿ(nh)　ˡ(lh)", "⁴⁷" }
  , { "　◌̚(gk'') ˺(gwk)　◌̴(z'') ~(sw) ɫ(lz/iz) ᵶ(zz)", "⁴⁸" }
  , { "　◌̝(dtk'') ˔(dtwk/twk)　◌̞(dt'') ˕(dtw/tw)　◌̘(dtq'')　◌̙(dtq'')", "⁴⁹" }
  , { "════════════  ", "⁵⁰" }
  -- , { "==============================", "⁵⁰" }
  , { "『 超音段成分 』", "⁵¹" }
  , { "　ˈ(pw)　ˌ(dpw/yw/dyw)　ː(dfkdf/dkd/dfdf/dfhdf)　ˑ(dfk/dk/df)", "⁵²" }
  , { "　◌̆(u'') ˘(uw/ufh)　|(iw)　‖(iwiw)", "⁵³" }
  , { "　.(daw) ·(aw)　‿(duw) ◌͜(du/dufh'')", "⁵⁴" }
  , { "────────────  ", "⁵⁵" }
  -- , { "------------------------------", "⁵⁵" }
  , { "『 音階和音調 』", "⁵⁶" }
  , { "　◌̋(pp'') ˝(pwpw)　◌́(p'') ˊ(pw)　◌̄(e'') ˉ(ew)", "⁵⁷" }
  , { "　◌̀(n'') ˋ(nw)　◌̏(n'')", "⁵⁸" }
  , { "　˥(gwk)　˦(twq)　˧(twq)　˨(twq)　˩(gwq)", "⁵⁹" }
  , { "　◌̌(v'') ˇ(vw)　◌̂(l'') ˆ(lw)", "⁶⁰" }
  , { "　ꜜ(lwk)　ꜛ(lw)　↗(lwq)　↘(lwq)", "⁶¹" }
  , { "════════════  ", "⁶²" }
  -- , { "==============================", "⁶²" }
  -- , { "", "⁶³" }
  , { "〔資料來源〕", "https://www.internationalphoneticassociation.org/IPAcharts/IPA_chart_orig/pdfs/IPA_Kiel_2020_full.pdf" }
  -- 以下中文 Wiki 內容較多，但較雜！
  -- , { "　閉：i(i) y(y)｜ɨ(it) ʉ(ut)｜ɯ(mq) u(u)", "³" }
  -- , { "次閉：　ɪ(ii;) ʏ(yi;)　ɨ̞(it)(dt@) ʉ̞(ut)(dt@)　ɯ̞(mq)(dt@) ʊ(wk)", "⁴" }
  -- , { "半閉：e(e) ø(ox)｜ɘ(ek) ɵ(qi)｜ɤ(vo/yo/oy) o(o)", "⁵" }
  -- , { "　中：e̞(e)(dt@) ø̞(ox)(dt@)｜ə(eq)｜ɤ̞(vo/yo/oy)(dt@) o̞(o)(dt@)", "⁶" }
  -- , { "半開：ɛ(ei) œ(ohe)｜ɜ(zi) ɞ(bf)｜ʌ(li/vk) ɔ(jf/ck)", "⁷" }
  -- , { "次開：æ(ahe)｜ɐ(aq)｜", "⁸" }
  -- , { "　開：a(a) ɶ(ohe;)｜ä(ab) ɒ̈(aq)(b@)｜ɑ(ai) ɒ(aq)", "⁹" }
  -- , { "｢肺部氣流音｣：", "¹⁰" }
  -- , { "鼻音：m̥(m)(do@) m(m) ɱ(mj) n̼(n)(dy@) n̥(n)(do@) n(n) ɳ̊(nc)(o@) ɳ(nc) ɲ̊(nj)(o@) ɲ(nj) ŋ̊(nj)(o@) ŋ(nj) ɴ(ni;)", "¹¹" }
  -- , { "塞音：p(p) b(b) p̪(p)(dr@) b̪(b)(dr@) t̼(t)(dy@) d̼(d)(dy@) t(t) d(d) ʈ(ti/tc) ɖ(dc/dt) c(c) ɟ(jt) k(k) ɡ(gi) q(q) ɢ(gi;) ʡ(jfyt/jyt/jfkt/jftf) ʔ(jfy/jy/jfk)", "¹²" }
  -- , { "有噝塞擦音：", "¹³" }
  -- , { "無噝塞擦音：", "¹⁴" }
  -- , { "有噝擦音：", "¹⁵" }
  -- , { "無噝擦音：", "¹⁶" }
  }

local kp_table = {
    { "  ※  […] 內為音標字符，(…) 內為編碼", "₀" }
  , { "  ════════════  ", "₁" }
  -- , { "  ==============================", "₁" }
  , { "  　  KK   ┊   DJ   ┊   IPA   ┃ 單字示例", "₂" }
  , { "  ════════════  ", "₃" }
  -- , { "  ==============================", "₃" }
  , { "  『 單母音/單元音 』", "₄" }
  , { "  　[i] (i) ┊ [iː] (i)(dfkdf/dkd/dfdf/dfhdf) ┊ [iː] ┃ seat", "₅" }
  , { "  　[ɪ] (ii;) ┊ [ɪ] ┊ [ɪ] ┃ sit", "₆" }
  , { "  　[e] (e) ┊ [eɪ] (e)(ii;) ┊ [eɪ] ┃ pain", "₇" }
  , { "  　[ɛ] (ei) ┊ [e] (e) ┊ [e] ┃ head ", "₈" }
  , { "  　[æ] (ahe) ┊ [æ] ┊ [æ] ┃ fat", "₉" }
  , { "　[ɑ] (ai) ┊ [ɑː] (ai)(dfkdf/dkd/dfdf/dfhdf) ┊ [ɑ] ┃ hot", "₁₀" }
  , { "　[o] (o) ┊ [əʊ] (eq)(wk) ┊ [əʊ] ┃ nose", "₁₁" }
  , { "　[ɔ] (jf/ck) ┊ [ɔː] (jf/ck)(dfkdf/dkd/dfdf/dfhdf) ┊ [ɔː] ┃ four", "₁₂" }
  , { "　[ɔ] (jf/ck) ┊ [ɔ] ┊ [ɒ] (aq) ┃ dog", "₁₃" }
  , { "　[u] (u) ┊ [uː] (u)(dfkdf/dkd/dfdf/dfhdf) ┊ [uː] ┃ too", "₁₄" }
  , { "　[ᴜ] (ui;) ┊ [ʊ] (wk) ┊ [ʊ] ┃ put", "₁₅" }
  , { "　[ʌ] (li/vk) ┊ [ʌ] ┊ [ʌ] ┃ sun", "₁₆" }
  , { "　[ə] (eq) ┊ [ə] ┊ [ə] ┃ again", "₁₇" }
  , { "　[ɪr] (ii;)(r) ┊ [ɪə] (ii;)(eq) ┊ [ɪə] ┃ rear", "₁₈" }
  , { "　[ɚ] (eqk) ┊ [ə] (eq) ┊ [ə˞] (eq)(kw) ┃ brother", "₁₉" }
  , { "　[ɝ] (zk/zr) ┊ [ɜ] (zi) ┊ [ɜ˞] (zi)(kw) ┃ bird ", "₂₀" }
  , { "────────────  ", "₂₁" }
  -- , { "------------------------------", "₂₁" }
  , { "『 雙母音/雙元音 』", "₂₂" }
  , { "　[aɪ] (a)(ii;) ┊ [aɪ] ┊ [aɪ] ┃ pie", "₂₃" }
  , { "　[aᴜ] (a)(ui;) ┊ [aʊ] (a)(wk) ┊ [aʊ] ┃ house", "₂₄" }
  , { "　[ɔɪ] (jf/ck)(ii;) ┊ [ɔɪ] ┊ [ɔɪ] ┃ coin", "₂₅" }
  , { "════════════  ", "₂₆" }
  -- , { "==============================", "₂₆" }
  , { "『 子音/輔音（清音）』", "₂₇" }
  , { "　[p] (p) ┊ [p] ┊ [p] ┃ pet", "₂₈" }
  , { "　[t] (t) ┊ [t] ┊ [t] ┃ ten", "₂₉" }
  , { "　[k] (k) ┊ [k] ┊ [k] ┃ key ", "₃₀" }
  , { "　[f] (f) ┊ [f] ┊ [f] ┃ fat ", "₃₁" }
  , { "　[s] (s) ┊ [s] ┊ [s] ┃ sing", "₃₂" }
  , { "　[θ] (qi) ┊ [θ] ┊ [θ] ┃ thank", "₃₃" }
  , { "　[ʃ] (sf) ┊ [ʃ] ┊ [ʃ] ┃ short", "₃₄" }
  , { "　[tʃ] (t)(sf) ┊ [tʃ] ┊ [tʃ] ┃ chair", "₃₅" }
  , { "　[h] (h) ┊ [h] ┊ [h] ┃ ha", "₃₆" }
  -- , { "------------------------------", "₃₇" }
  , { "────────────  ", "₃₇" }
  , { "『 子音/輔音（濁音）』", "₃₈" }
  , { "　[b] (b) ┊ [b] ┊ [b] ┃ book", "₃₉" }
  , { "　[d] (d) ┊ [d] ┊ [d] ┃ desk", "₄₀" }
  , { "　[g] (g) ┊ [g] ┊ [ɡ] (gi) ┃ get", "₄₁" }
  , { "　[v] (v) ┊ [v] ┊ [v] ┃ vest", "₄₂" }
  , { "　[z] (z) ┊ [z] ┊ [z] ┃ zoo", "₄₃" }
  , { "　[ð] (dfx/dx/dt) ┊ [ð] ┊ [ð] ┃ this", "₄₄" }
  , { "　[ʒ] (zf) ┊ [ʒ] ┊ [ʒ] ┃ measure", "₄₅" }
  , { "　[dʒ] (d)(zf) ┊ [dʒ] ┊ [dʒ] ┃ john", "₄₆" }
  , { "　[m] (m) ┊ [m] ┊ [m] ┃ mom", "₄₇" }
  , { "　[n] (n) ┊ [n] ┊ [n] ┃ nose", "₄₈" }
  , { "　[ŋ] (nj) ┊ [ŋ] ┊ [ŋ] ┃ sing", "₄₉" }
  , { "　[l] (l) ┊ [l] ┊ [l] ┃ long", "₅₀" }
  , { "　[r] (r) ┊ [r] ┊ [r] ┃ red", "₅₁" }
  , { "　[j] (j) ┊ [j] ┊ [j] ┃ yes", "₅₂" }
  , { "　[w] (w) ┊ [w] ┊ [w] ┃ we", "₅₃" }
  , { "════════════  ", "₅₄" }
  -- , { "==============================", "₅₄" }
  , { "『 重音和次重音 』（補充）", "₅₅" }
  , { "　[ ˋ ] (nw) ┊ [ ˋ ] ┊ [ ˈ ] (pw) ┃ pencil", "₅₆" }
  , { "　[ ˏ ] (dpw/dnw) ┊ [ ˏ ] ┊ [ ˌ ] (dpw/yw/dyw) ┃ education", "₅₇" }
  , { "　※ 奇摩字典 KK 和 DJ 次重音用〔希臘小寫數字標記〕字符：", "₅₈" }
  , { "　　  [ ͵ ] ，須用希臘掛接方案 (啟始鍵+dpw) 輸入。", "₅₉" }
  , { "════════════  ", "₆₀" }
  -- , { "==============================", "₆₀" }
  , { "〔資料來源〕", "https://zh.wikipedia.org/wiki/KK%E9%9F%B3%E6%A8%99" }
  }

local kg_table = {
    { "『 基礎希臘字母 』", "Ⅰ" }
  , { "Αα(a)　Ββ(b)　ς(c*)　Δδ(d)　Εε(e)　Φφ(f)", "Ⅱ" }
  , { "Γγ(g)　Ηη(h)　Ιι(i)　Ξξ(j)　Κκ(k)　Λλ(l)", "Ⅲ" }
  , { "Μμ(m)　Νν(n)　Οο(o)　Ρρ(p)　Θθ(q)　Ππ(r)", "Ⅳ" }
  , { "Σσ(s)　Ττ(t)　Ψψ(u)　ν(v*)　Ωω(w)　Χχ(x)", "Ⅴ" }
  , { "Υυ(y)　Ζζ(z)", "Ⅵ" }
  , { "『 已停用希臘字母 』", "Ⅶ" }
  , { "Ϝϝ(fi)　Ͷͷ(ni)　Ϛϛ(ci)　Ͱͱ(ih)　Ϻϻ(mi/mf/myc/my)", "Ⅷ" }
  , { "Ϙϙ(oy)　Ϟϟ(kf/kw)　Ͳͳ(ti)　Ϡϡ(zf)", "Ⅸ" }
  , { "『 補充希臘字母 』", "Ⅹ" }
  , { "Ϳϳ(ji)　Ϸϸ(lf/bhp/iho/lho)", "Ⅺ" }
  , { "", "Ⅻ" }
  , { "", "Ⅼ" }
  , { "", "Ⅽ" }
  , { "", "Ⅾ" }
  , { "", "Ⅿ" }
  , { "", "Ↄ" }
  }

local kc_table = {
    { "『 基礎俄文字母 』", "ⅰ" }
  , { "Аа(a)　Вв(b)　Сс(c)　Дд(d)　Ее(e)　Фф(f)", "ⅱ" }
  , { "Гг(g)　Нн(h)　Юю(i/iho)　Жж(j)　Кк(k)", "ⅲ" }
  , { "Лл(l/jhi)　Мм(m)　Ии(n)　Оо(o)　Рр(p)　Ээ(q)", "ⅳ" }
  , { "Пп(r)　Бб(s)　Тт(t)　Чч(u)　Цц(v)　Шш(w)", "ⅴ" }
  , { "Хх(x)　Уу(y)　Зз(z)", "ⅵ" }
  , { "Ьь(bf*)　Ыы(bi*/bhi)　Ъъ(br)", "ⅶ" }
  , { "Ёё(eb)　Йй(nu)　Яя(rk)　Щщ(wy)", "ⅷ" }
  , { "『 早期俄文字母 』", "ⅸ" }
  , { "Ѣѣ(bt)　Іі(ii)　Ѵѵ(vr)　Ѳѳ(qi)", "ⅹ" }
  , { "Ѫѫ(vf)　Ѭѭ(ivf/ihvf)　Ѧѧ(af)　Ѩѩ(iaf/ihaf)", "ⅺ" }
  , { "『 早期西里爾字母 』", "ⅻ" }
  , { "Ѕѕ(si)　Ꙁꙁ(zj)　Ѹѹ(ohy)　Ѡѡ(wi)", "ⅼ" }
  , { "Ꙑꙑ(bri/brhi)　Ꙗꙗ(iha)　Ѥѥ(iqk/ihc/ihqk)", "ⅽ" }
  , { "Ѯѯ(zfy/zfv/zcy/zcv/zyc/zvc)　Ѱѱ(ui)", "ⅾ" }
  , { "Ҁҁ(cfy/cy/cfk)", "ⅿ" }
  , { "Її(ib)　Ѻѻ(of)　Ѿѿ(wt)", "ↄ" }
  }

return { kh = kh_table,
         ks = ks_table,
         kj = kj_table,
         ki = ki_table,
         kp = kp_table,
         kg = kg_table,
         kc = kc_table,
       }